{
    "baseUrl": "https://api.buildnumber.io",
    "endpoints": [{
        "title": "Create a new build",
        "details": "This will create a new build for the `com.example.myapp` package. If you never created a build for this package before, the initial build number will be `1`.",
        "method": "POST",
        "path": "/com.example.myapp/builds",
        "auth": true,
        "response": {
            "buildNumber": 42
        }    
    }, {
        "title": "Create a new build and return its build number in plain text",
        "details": "This is useful for bash scripts, since you can just store the request output in a variable.",
        "method": "POST",
        "path": "/com.example.myapp/builds?output=buildNumber",
        "auth": true,
        "response": "43"
    }, {
        "title": "Create a new build with additional information",
        "details": "You can pass a JSON-encoded meta data dictionary for your build. You can retrieve this data later when querying a specific build.",
        "method": "POST",
        "path": "/com.example.myapp/builds",
        "auth": true,
        "data": {
            "head": "60b7eca"
        },
        "response": {
            "buildNumber": 44,
            "head": "60b7eca"
        }
    }, {
        "title": "Get the last build",
        "method": "GET",
        "path": "/com.example.myapp/builds/last",
        "auth": true,
        "response": {
            "buildNumber": 44,
            "head": "60b7eca"
        }
    }, {
        "title": "Get a specific build by its build number",
        "method": "GET",
        "path": "/com.example.myapp/builds/43",
        "auth": true,
        "response": {
            "buildNumber": 43
        }
    }, {
        "title": "Get a unique build number for a specific package version",
        "details": "Instead of generating a new build number that is unique for all builds, you can request a build number for a specific package version. For instance, you can request a build number for v1.0 of your package as follows.\n\nAll the previous examples are valid with this pattern, you can create a build, get a specific build, get the last build, add extra parameters, just like you would do without a version. Both patterns can also be used altogether: you can request a build number specific to a version *and* you can request a build number that is unique to non-versionned packages.",
        "method": "POST",
        "path": "/com.example.myapp/1.0/builds",
        "auth": true,
        "response": {
            "buildNumber": 1
        }  
    }]
}
